In [1]:
import pandas as pd

In [2]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\hp\appdata\roaming\python\python312\site-packages (2.2.0)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\hp\appdata\roaming\python\python312\site-packages (from pandas) (1.26.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\appdata\roaming\python\python312\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\appdata\roaming\python\python312\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\hp\appdata\roaming\python\python312\site-packages (from pandas) (2023.4)
Requirement already satisfied: six>=1.5 in c:\users\hp\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [5]:
df = pd.read_csv('mall.csv')

In [6]:
df.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [7]:
df.head(3)

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6

In [8]:
df.tail()

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

In [9]:
df.tail(3)

     CustomerID Gender  Age  Annual Income (k$)  Spending Score (1-100)
197         198   Male   32                 126                      74
198         199   Male   32                 137                      18
199         200   Male   30                 137                      83

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df.columns

Index(['CustomerID', 'Gender', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

In [12]:
list(df.columns)

['CustomerID', 'Gender', 'Age', 'Annual Income (k$)', 'Spending Score (1-100)']

In [13]:
df['Gender']

0        Male
1        Male
2      Female
3      Female
4      Female
        ...
195    Female
196    Female
197      Male
198      Male
199      Male
Name: Gender, Length: 200, dtype: object

In [14]:
df['Age']

0      19
1      21
2      20
3      23
4      31
       ..
195    35
196    45
197    32
198    32
199    30
Name: Age, Length: 200, dtype: int64

In [15]:
type(df['Age'])

pandas.core.series.Series

In [16]:
type(df['Gender'])

pandas.core.series.Series

In [17]:
list(df['Age'])

[19,
 21,
 20,
 23,
 31,
 22,
 35,
 23,
 64,
 30,
 67,
 35,
 58,
 24,
 37,
 22,
 35,
 20,
 52,
 35,
 35,
 25,
 46,
 31,
 54,
 29,
 45,
 35,
 40,
 23,
 60,
 21,
 53,
 18,
 49,
 21,
 42,
 30,
 36,
 20,
 65,
 24,
 48,
 31,
 49,
 24,
 50,
 27,
 29,
 31,
 49,
 33,
 31,
 59,
 50,
 47,
 51,
 69,
 27,
 53,
 70,
 19,
 67,
 54,
 63,
 18,
 43,
 68,
 19,
 32,
 70,
 47,
 60,
 60,
 59,
 26,
 45,
 40,
 23,
 49,
 57,
 38,
 67,
 46,
 21,
 48,
 55,
 22,
 34,
 50,
 68,
 18,
 48,
 40,
 32,
 24,
 47,
 27,
 48,
 20,
 23,
 49,
 67,
 26,
 49,
 21,
 66,
 54,
 68,
 66,
 65,
 19,
 38,
 19,
 18,
 19,
 63,
 49,
 51,
 50,
 27,
 38,
 40,
 39,
 23,
 31,
 43,
 40,
 59,
 38,
 47,
 39,
 25,
 31,
 20,
 29,
 44,
 32,
 19,
 35,
 57,
 32,
 28,
 32,
 25,
 28,
 48,
 32,
 34,
 34,
 43,
 39,
 44,
 38,
 47,
 27,
 37,
 30,
 34,
 30,
 56,
 29,
 19,
 31,
 50,
 36,
 42,
 33,
 36,
 32,
 40,
 28,
 36,
 36,
 52,
 30,
 58,
 27,
 59,
 35,
 37,
 32,
 46,
 29,
 41,
 30,
 54,
 28,
 41,
 36,
 34,
 32,
 33,
 38,
 47,
 35,
 45,
 32,
 32,
 30]

In [18]:
df[['Age']]

     Age
0     19
1     21
2     20
3     23
4     31
..   ...
195   35
196   45
197   32
198   32
199   30

[200 rows x 1 columns]

In [19]:
type(df[['Age']])

pandas.core.frame.DataFrame

In [20]:
df.columns

Index(['CustomerID', 'Gender', 'Age', 'Annual Income (k$)',
       'Spending Score (1-100)'],
      dtype='object')

In [23]:
df[['Age','Gender']]

     Age  Gender
0     19    Male
1     21    Male
2     20  Female
3     23  Female
4     31  Female
..   ...     ...
195   35  Female
196   45  Female
197   32    Male
198   32    Male
199   30    Male

[200 rows x 2 columns]

In [24]:
df.dtypes

CustomerID                 int64
Gender                    object
Age                        int64
Annual Income (k$)         int64
Spending Score (1-100)     int64
dtype: object